# Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.

s1 = input('String 1 = ')
s2 = input('String 2 = ')

print(s1.count(s2))
